Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

In [6]:
content = pd.read_csv("randomcsv.csv")

In [8]:
content.head()

            Name  Age                      Email     Phone
0     John Smith   35     john.smith@example.com  555-1234
1  Emily Johnson   28  emily.johnson@example.com  555-5678
2  Michael Davis   42  michael.davis@example.com  555-9012
3   Sarah Wilson   31   sarah.wilson@example.com  555-3456
4    David Brown   39    david.brown@example.com  555-7890

In [9]:
content.tail()

            Name  Age                      Email     Phone
0     John Smith   35     john.smith@example.com  555-1234
1  Emily Johnson   28  emily.johnson@example.com  555-5678
2  Michael Davis   42  michael.davis@example.com  555-9012
3   Sarah Wilson   31   sarah.wilson@example.com  555-3456
4    David Brown   39    david.brown@example.com  555-7890

In [10]:
content['Age']

0    35
1    28
2    42
3    31
4    39
Name: Age, dtype: int64

In [11]:
content.describe()

             Age
count   5.000000
mean   35.000000
std     5.700877
min    28.000000
25%    31.000000
50%    35.000000
75%    39.000000
max    42.000000

In [12]:
content.iloc[0:2,[0,1,2]]

            Name  Age                      Email
0     John Smith   35     john.smith@example.com
1  Emily Johnson   28  emily.johnson@example.com

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [14]:
df.index = [i * 2 + 1 for i in range(len(df))]

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [1]:
def sumofcol(df):
    colname = "Age"
    summ=0
    for i in range(0,4):
        summ =summ+ df[[colname]][i]
    print(summ)
sumofcol(content)

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [1]:
content['Word_Count']=len(content['Text'])

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans. DataFrame.size() : returns the number of cells in a dataframe.
DataFrame.shape() : returns the structure of dataframe i.e. only two values representing number of rows and columns 
in a dataframe.

Q6. Which function of pandas do we use to read an excel file?

Ans. We use read_excel() function of pandas to read excel files.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [5]:
def usernameextract(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

df = pd.DataFrame({'Email':['abc@gmail.com','pqrs@gmail.com']})
df = usernameextract(df)
print(df)

            Email Username
0   abc@gmail.com      abc
1  pqrs@gmail.com     pqrs

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [ ]:
t=(,)
for i in df :
    if (i['A']>5 and i['B']<10):
        t = t+ i
newdf = pd.DataFrame
newdf['Selected'] = t

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [ ]:
def statsanalysis(df):
    mean = df['Values'].meann()
    median = df['Values'].median()
    stdev = df['Values'].std()
    return (mean,median,stdev)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [ ]:
def calculate_moving_average(df):
    
    df['Date'] = pd.to_datetime(df['Date'])

    
    df.sort_values('Date', inplace=True)

    
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [ ]:
df['Weekday'] = df['Date'].dt.weekday_name

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [ ]:
import pandas as pd

def select_rows_between_dates(df):

    # Create a boolean mask for rows between the specified dates
    mask = (df['Date'].dt.date >= pd.to_datetime('2023-01-01').date()) & (df['Date'].dt.date <= pd.to_datetime('2023-01-31').date())

    # Select rows using the boolean mask
    selected_rows = df[mask]

    return selected_rows

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

pandas